<?php

/**
 * code 规则
 * 4位数， 第一位0-4
 * 0：特殊提示
 * 1-4：增删改查
 */
return [
    'common'  => [
        '1001' => '新增成功',
        '1002' => '新增失败，发生未知错误',
        '1003' => '新增失败，缺少必填信息',
        '2001' => '删除成功',
        '2002' => '删除失败，发生未知错误',
        '3001' => '编辑成功',
        '3002' => '编辑失败，发生未知错误',
        '3003' => '编辑失败，缺少必填项',
        '5001' => '操作成功',
        '5002' => '操作失败，发生未知错误',
        '5003' => '操作失败，数据不存在已经删除',
    ],
    'file'    => [
        'UPLOAD_ERR_INI_SIZE'   => '上传失败，上传的文件超过了 php.ini 中 upload_max_filesize选项限制的值',
        'UPLOAD_ERR_FORM_SIZE'  => '上传失败，上传文件的大小超过了 HTML 表单中 MAX_FILE_SIZE 选项指定的值',
        'UPLOAD_ERR_PARTIAL'    => '上传失败，文件只有部分被上传',
        'UPLOAD_ERR_NO_FILE'    => '上传失败，没有文件被上传',
        'UPLOAD_ERR_NO_TMP_DIR' => '上传失败，找不到临时文件夹',
        'UPLOAD_ERR_CANT_WRITE' => '上传失败，文件写入失败',
        '1001'                  => '上传成功',
        '1002'                  => '下载失败，不存在这个资源',
    ],
    'login'   => [
        '0001' => '登录失败，用户名或密码不得为空',
        '0002' => '登录失败，用户名或密码错误',
        '0003' => '登录成功',
        '0004' => '退出成功',
    ],
    'user'    => [
        '1001' => '新增失败，内容不得为空',
        '1002' => '新增失败，用户名不得为空',
        '1003' => '新增失败，邮箱地址不得为空',
        '1004' => '新增失败，密码不得为空',
        '1005' => '新增失败，用户名已经存在',
        '1006' => '新增失败，邮箱地址已被占用',
        '3001' => '编辑失败，用户名不得为空',
        '3002' => '编辑失败，用户名已被占用',
        '3003' => '编辑失败，邮箱地址不得为空',
        '3004' => '编辑失败，邮箱地址已被占用',
        '3005' => '编辑失败，密码不得为空',
        '3006' => '编辑失败，内容不得为空',
        '4001' => '查询失败，用户不存在或已被删除',
    ],
    'article' => [
        '1001' => '新增失败，文章标题不得为空',
        '1002' => '新增失败，文章内容不得为空',
        '1003' => '新增失败，文章类别不得为空',
        '2001' => '删除失败，文章不存在或已被删除',
        '2002' => '删除失败，文章不存在或已被加入回收站',
        '3001' => '编辑失败，文章不存在或已被删除',
        '3002' => '编辑失败，文章标题不得为空',
        '3003' => '编辑失败，文章内容不得为空',
        '3004' => '编辑失败，文章分类不得为空',
        '4001' => '查询失败，文章不存在或已被删除',
    ],
    'website' => [
        '0001' => '正在导出数据，导出完成请在网站备份处下载备份文件',
    ],
    'leave'   => [
        '1001' => '留言成功',
        '4001' => '留言失败，发生未知错误',
    ],
];
